TJ215702/stm8/main.c
    }

    FLASH_Lock(FLASH_MEMTYPE_DATA);
    return 0;   // not found
}

u8 Save_Combined_Key(uint8_t *rfid, uint8_t *rf433_full) {
    uint8_t num, i, k;
    uint16_t addr;
    uint8_t rfid_match, rf433_match,write_index;
    uint8_t existing_rfid[4];
    uint8_t existing_rf433[8];

    FLASH_Unlock(FLASH_MEMTYPE_DATA);
    num = FLASH_ReadByte(KEY_COUNT_ADDR);
    if (num > MAX_KEY_NUM)
        num = 0;

    // --- 第一部分：檢查是否已存在 ---
    for (i = 0; i < num; i++) {
        addr = KEY_DATA_START_ADDR + (i * KEY_BLOCK_SIZE);

        rfid_match = 1;
        rf433_match = 1;

        // 檢查 RFID 是否重複 (4 bytes)
        for (k = 0; k < 4; k++) {
            if (FLASH_ReadByte(addr + k) != rfid[k]) {
                rfid_match = 0;
                break;
            }
        }

        // 檢查 433M 是否重複 (8 bytes, 含 CRC)
        for (k = 0; k < 8; k++) {
            if (FLASH_ReadByte(addr + 4 + k) != rf433_full[k]) {
                rf433_match = 0;
                break;
            }
        }

        // 如果其中任一個已經存在，就放棄寫入並退出
        if (rfid_match || rf433_match) {
            UART2_SendStr("Key already exists! Skip saving.");
            FLASH_Lock(FLASH_MEMTYPE_DATA);
            return 1;
        }
    }

    // --- 第二部分：確定不存在，執行寫入 ---
    // 這裡我們採用循環覆蓋邏輯，若 num=5 則從 0 開始存
    write_index = (num >= MAX_KEY_NUM) ? 0 : num;
    addr = KEY_DATA_START_ADDR + (write_index * KEY_BLOCK_SIZE);

    // 寫入 RFID
    for (k = 0; k < 4; k++) {
        FLASH_ProgramByte(addr + k, rfid[k]);
    }
    // 寫入 433MHz (含 CRC 共 8 bytes)
    for (k = 0; k < 8; k++) {
        FLASH_ProgramByte(addr + 4 + k, rf433_full[k]);
    }

    // 更新數量 (如果還沒滿才增加，滿了就維持 MAX_KEY_NUM)
    if (num < MAX_KEY_NUM) {
        FLASH_ProgramByte(KEY_COUNT_ADDR, num + 1);
    }

    FLASH_Lock(FLASH_MEMTYPE_DATA);
    UART2_SendStr("New Key saved successfully.");
    return 0;
}


/* 20ms pulse */
static void Motor_Pulse_Fwd_20ms(void)
{
    MOTOR_FWD();
    Delay_ms(20);
    MOTOR_STOP();
}

static void Motor_Pulse_Rev_20ms(void)
{
    MOTOR_REV();
    Delay_ms(20);
    MOTOR_STOP();
}

void Read_EEpeomData_125(void)
{
    unsigned int x;
    unsigned char EEprom_Buff[SET_BUFF_MAX];

    FLASH_Unlock(FLASH_MEMTYPE_DATA);
    for (x = 0; x < SET_BUFF_MAX; x++)
        EEprom_Buff[x] = FLASH_ReadByte(0x00004000 + x);
    FLASH_Lock(FLASH_MEMTYPE_DATA);

    if ((EEprom_Buff[0] == 0xA5) && (EEprom_Buff[1] == 0x5A))
    {
        for (x = 0; x < SET_BUFF_MAX; x++)
            Set_Buff[x] = EEprom_Buff[x];
        LF_PLL_SET(LF_PLL);
    }

}

void Write_EEpeomData_125(void)
{
    unsigned char i;

    FLASH_Unlock(FLASH_MEMTYPE_DATA);

    for (i = 0; i < MCU_REG_NUM; i++)
        FLASH_ProgramByte(0x00004000 + i, mcu_user_config[i]);

    FLASH_Lock(FLASH_MEMTYPE_DATA);
}

u8 Check_Combined_433M(uint8_t *target_rf433) {
    uint8_t i, k, match, num;
    uint16_t addr;

    FLASH_Unlock(FLASH_MEMTYPE_DATA);
    num = FLASH_ReadByte(KEY_COUNT_ADDR);
    if (num > MAX_KEY_NUM) num = MAX_KEY_NUM;

    for (i = 0; i < num; i++) {
        addr = KEY_DATA_START_ADDR + (i * KEY_BLOCK_SIZE);
        match = 1;
        // 從偏移量 +4 開始比對 8 bytes (含 CRC)
        for (k = 0; k < 8; k++) {
            if (FLASH_ReadByte(addr + 4 + k) != target_rf433[k]) {
                match = 0;
                break;
            }
        }
        if (match) {
            FLASH_Lock(FLASH_MEMTYPE_DATA);
            return 1;
        }
    }
    FLASH_Lock(FLASH_MEMTYPE_DATA);
    return 0;
}

u8 Check_Combined_RFID(uint8_t *target_rfid) {
    uint8_t i, k, match, num;
    uint16_t addr;

    FLASH_Unlock(FLASH_MEMTYPE_DATA);
    num = FLASH_ReadByte(KEY_COUNT_ADDR);
    if (num > MAX_KEY_NUM) num = MAX_KEY_NUM;

    for (i = 0; i < num; i++) {
        addr = KEY_DATA_START_ADDR + (i * KEY_BLOCK_SIZE);
        match = 1;
        // 從偏移量 +0 開始比對 4 bytes
        for (k = 0; k < 4; k++) {
            if (FLASH_ReadByte(addr + k) != target_rfid[k]) {
                match = 0;
                break;
            }
        }
        if (match) {
            FLASH_Lock(FLASH_MEMTYPE_DATA);
            return 1;
        }
    }
    FLASH_Lock(FLASH_MEMTYPE_DATA);
    return 0;
}

static void GPIO_Config(void)
{

    GPIO_Init(GPIOD, GPIO_PIN_3, GPIO_MODE_OUT_PP_LOW_FAST); /* D3 BR_LIGHT */
    GPIO_Init(GPIOB, GPIO_PIN_3, GPIO_MODE_OUT_PP_LOW_FAST); /* B3 LP_RIGHT */
    GPIO_Init(GPIOC, GPIO_PIN_2, GPIO_MODE_OUT_PP_LOW_FAST); /* Motor IN2 */
    GPIO_Init(GPIOB, GPIO_PIN_0, GPIO_MODE_OUT_PP_LOW_FAST); /* Motor IN1 */
    GPIO_Init(GPIOB, GPIO_PIN_1, GPIO_MODE_OUT_PP_LOW_FAST); /* BZ */

    GPIO_Init(GPIOB, GPIO_PIN_4, GPIO_MODE_IN_PU_IT);  //POWER KEY
    GPIO_Init(GPIOA, GPIO_PIN_2, GPIO_MODE_IN_FL_NO_IT); //LEARN KEY
    GPIO_Init(GPIOB, GPIO_PIN_5, GPIO_MODE_IN_FL_NO_IT); //IGN KEY

    GPIO_Init(GPIOD, GPIO_PIN_2, GPIO_MODE_OUT_PP_HIGH_FAST); //syn531 default disable
    GPIO_Init(GPIOD, GPIO_PIN_0, GPIO_MODE_IN_PU_NO_IT);    //RF DO
    GPIO_Init(GPIOE, GPIO_PIN_5, GPIO_MODE_OUT_PP_LOW_FAST);  //125k enable

    /* init gpio status */
    BR_LIGHT_OFF();
    LP_RIGHT_OFF();
    MOTOR_STOP();
    BZ_OFF();
    GPIO_WriteLow (GPIOD, GPIO_PIN_2);  //syn531 enable
}

/* ================= EXTI ================= */

static void EXTI_Config(void)
{
    /* PORTB rising edge */
    EXTI_SetExtIntSensitivity(EXTI_PORT_GPIOB,
                              EXTI_SENSITIVITY_RISE_ONLY);
}

/* ================= ISR ================= */

INTERRUPT_HANDLER(EXTI_PORTB_IRQHandler, 4)
{
    TJTW_PKE.power_event_flag = 1;
}

void TIM2_Init(void)
{
    TIM2_DeInit();
    TIM2_TimeBaseInit(TIM2_PRESCALER_16,100);   /* 0.1ms */
    TIM2_ITConfig(TIM2_IT_UPDATE , ENABLE);
    TIM2_OC2Init(TIM2_OCMODE_PWM1, TIM2_OUTPUTSTATE_ENABLE, 0, TIM2_OCPOLARITY_HIGH);
    TIM2_OC2PreloadConfig(ENABLE);
    TIM2_SetCounter(0x0000);
    TIM2_Cmd(ENABLE);
}


void RF_Remote(void)
{
    unsigned char i,j;
    const char hex_chars[] = "0123456789ABCDEF";
    char hex_out[4];
    uint16_t received_crc, calculated_crc;
    disableInterrupts()
    for (i = 0; i < 8; i++) {
        RF_UartSend[i] = Buff_B[i];
    }
    received_crc = ((uint16_t)RF_UartSend[6] << 8) | (uint16_t)RF_UartSend[7];
    calculated_crc = Calculate_CRC16(RF_UartSend, 6);


