TJ215702/stm8/main.c
    RFFull = 0;
    if (calculated_crc == received_crc) {
        RF_set=1;
        UART2_SendString("\r\nRF Data: ", 11);
        for (i = 0; i < 8; i++) {
                uint8_t val = RF_UartSend[i];

                hex_out[0] = hex_chars[(val >> 4) & 0x0F];

                hex_out[1] = hex_chars[val & 0x0F];

                hex_out[2] = ' ';

                UART2_SendString((unsigned char*)hex_out, 3);
            }
    }
    else
        UART2_SendString("\r\nRF Data CRC Error! ", 22);
    enableInterrupts();
        UART2_SendString("\r\n", 2);

}


@far @interrupt void tim2_irqhandler(void)
{
    /* Clear TIM2 update interrupt flag */
    TIM2_ClearITPendingBit(TIM2_IT_UPDATE);

    /* -------------------------------------------------------------
     * Time base: 1 ms tick and 10 ms tick
     * ------------------------------------------------------------- */
    Time_1ms++;

    if (Time_1ms >= 10)
    {
        Time_1ms = 0;
        Time_Nms++;

        /* LF send timer countdown (clamp to 0) */
        if ((LF_ENABLE == 1) && (LF_Send_Tim > 0))
            LF_Send_Tim--;
        else
            LF_Send_Tim = 0;
    }

    /* If an RF frame is already captured, skip decoding */
    if (RFFull)
        return;

    /* -------------------------------------------------------------
     * RF OOK decoding:
     * - Measure LOW pulse width (LL_w) while RF_DATA is low
     * - On rising edge (LOW -> HIGH), interpret the LOW width
     * ------------------------------------------------------------- */
    if (RF_DATA_LOW())
    {
        /* Accumulate LOW width in ticks */
        LL_w++;
        RFBit = 0;   /* Mark current level as LOW */
    }
    else
    {
        /* Rising edge: process the LOW width that just ended */
        if (!RFBit)
        {
            if (!First_flag)
            {
                /* Detect sync/preamble LOW width */
                if ((LL_w > 40) && (LL_w < 60))
                {
                    First_flag = 1;
                    BitCount   = 0;
                    Buff_B[0] = Buff_B[1] = Buff_B[2] = 0;
                    Buff_B[3] = Buff_B[4] = Buff_B[5] = 0;
                    Buff_B[6] = Buff_B[7] = 0;
                }
            }
            else
            {
                /* Decode data bits by LOW width */
                if ((LL_w > 3) && (LL_w <= 7))
                {
                    /* Bit '1' */
                    if (BitCount < RF_LEN)
                    {
                        Buff_B[BitCount >> 3] <<= 1;
                        Buff_B[BitCount >> 3] |= 0x01;
                        BitCount++;
                    }
                }
                else if ((LL_w >= 8) && (LL_w < 13))
                {
                    /* Bit '0' */
                    if (BitCount < RF_LEN)
                    {
                        Buff_B[BitCount >> 3] <<= 1;
                        BitCount++;
                    }
                }
                else
                {
                    /* Invalid width: reset decoder state */
                    First_flag = 0;
                    BitCount   = 0;
                }

                /* Frame complete */
                if (BitCount >= RF_LEN)
                {
                    BitCount   = 0;
                    First_flag = 0;
                    RFFull     = 1;
                }
            }

            /* Reset LOW width counter after processing */
            LL_w = 0;
        }

        RFBit = 1;   /* Mark current level as HIGH */
    }
}

main()
{
    int i,ret,idle;
    uint8_t ign_wait = 0;
    u8 rfid_set=0;

    uint16_t brightness = 0; // bright pwm (0 到 999)
    uint8_t up = 1;
    unsigned char rc522_SN[4];
    TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
    TJTW_PKE.power_event_flag = 0;
    TJTW_PKE.learn_event_flag = 0;
    idle=0;

    Clock_Config();
    GPIO_Config();
    EXTI_Config();
    TIM4_DeInit();
    TIM4_Init();
	//MX_TIM4_Init();
    Uart_Init();
    InitRc522();
    Delay_ms(100);
    //TIM2_PWM_Config();
    //Clear_PKE_EEPROM();

    LF_ClockOccurs(125);
    Write_EEpeomData_125();
    Read_EEpeomData_125();

    Delay_InIt(16);
    TIM2_Init();   //need ro mask  TIM2_PWM_Config()

    enableInterrupts();
		
    UART2_SendStr("system start!");
		
    while(1)
    {
        // LF_SendData(PATTERN1,PATTERN2,PATTREN_BIT,LF_SEND_CH1);
        // Delay_ms(250);
        // if (RFFull) {
        //     RF_Remote();
        // }
       
        switch(TJTW_PKE.oper_state) {
            case PKE_OPER_STA_POWER_OFF:
                UART2_SendStr("PKE_OPER_STA_POWER_OFF in!");
                enableInterrupts();
                MOTOR_STOP();
                Delay_ms(50);
                halt();
                Delay_ms(50);
                Clock_Config();
                TIM4_Init();
                Uart_Init();
                InitRc522();
                Delay_ms(50);

                if(TJTW_PKE.power_event_flag) {
                    TJTW_PKE.power_event_flag = 0;
                    if(GPIO_ReadInputPin(GPIOA, GPIO_PIN_2))
                    {
                        TJTW_PKE.oper_state = PKE_OPER_STA_LEARN;
                    }
                    else
                    {
                        TJTW_PKE.oper_state = PKE_OPER_STA_POWER_ON;
                    }
                }
                Uart_Init();
                UART2_SendStr("PKE_OPER_STA_POWER_OFF out!");
                break;
            case PKE_OPER_STA_POWER_ON:
                UART2_SendStr("PKE_OPER_STA_POWER_ON in!");
                enableInterrupts();
                i=0;
                ret=0;
                UART2_SendStr("Check 433m key!");
                while(i<15) {
                    LF_SendData(PATTERN1,PATTERN2,PATTREN_BIT,LF_SEND_CH1);
                    Delay_ms(250);
                    if (RFFull) {
                        RF_Remote();
                        if (Check_Combined_433M(RF_UartSend)) {
                            UART2_SendStr("433m key matched!");
                            ret=1;
                        }
                        else {
                            UART2_SendStr("433m key not matched!");
                            ret=0;
                        }
                        break;
                    }
                    i++;
                }

                if (ret == 0) {
                    UART2_SendStr("433m key not matched find RFID TAG!");
                    for(i=0;i<50;i++) {
                        Delay_ms(100);

