TJ215702/stm8/main.c
                        showcard(Tx_Buffer,&rfid_set,rc522_SN);
                        Reset_RC522();
                        if(rfid_set ==1) {
                            UART2_SendString(Tx_Buffer, 17);
                            rfid_set=0;
                            i=50;
                            ret=Check_RC522Key(rc522_SN);
                        }
                    }
                }

                if(ret == 1) {
                        Motor_Pulse_Fwd_20ms();
                        TJTW_PKE.oper_state = PKE_OPER_STA_WAIT;
                } else {
                        TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
                }
                UART2_SendStr("PKE_OPER_STA_POWER_ON out!");
                break;
            case PKE_OPER_STA_WAIT:
                UART2_SendStr("PKE_OPER_STA_WAIT in!");
                if(IGN_IS_ON()) {  //ign on
                    TJTW_PKE.oper_state = PKE_OPER_STA_IDLE;
                    UART2_SendStr("IGN_ON PKE_OPER_STA_WAIT out!");
                }
                else {
                    if(ign_wait >=10) {
                        TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
                        ign_wait=0;
			Motor_Pulse_Rev_20ms();
                        UART2_SendStr("PKE_OPER_STA_WAIT out!");
                    }
                    else {
                        Delay_ms(1000);
                        ign_wait++;
                    }
                }

                break;
            case PKE_OPER_STA_IDLE:
                if(idle==0) {
                    UART2_SendStr("PKE_OPER_STA_IDLE in!");
                    idle=1;
                    TIM2_CCxCmd(TIM2_CHANNEL_2, ENABLE);
                }
                BR_PWM(&brightness, &up);
                Delay_ms(10);
                if(TJTW_PKE.power_event_flag)
                {
                    TJTW_PKE.power_event_flag = 0;
					Motor_Pulse_Rev_20ms();  //Power OFF event => Motor reverse 20ms
                    TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
                    TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
                    GPIO_Init(GPIOD, GPIO_PIN_3, GPIO_MODE_OUT_PP_LOW_FAST);
                    UART2_SendStr("PKE_OPER_STA_IDLE out!");
                    idle=0;
                }
                else if (!IGN_IS_ON()) {  //ign off
                    Motor_Pulse_Rev_20ms();
                    TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
                    TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
                    GPIO_Init(GPIOD, GPIO_PIN_3, GPIO_MODE_OUT_PP_LOW_FAST);
                    UART2_SendStr("IGN_OFF PKE_OPER_STA_IDLE out!");
                    idle=0;
                }
                break;
            case PKE_OPER_STA_LEARN:
                UART2_SendStr("PKE_OPER_STA_LEARN in!");
                TIM2_Init();
                TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
                GPIO_Init(GPIOD, GPIO_PIN_3, GPIO_MODE_OUT_PP_LOW_FAST);
                enableInterrupts();
                for(i=0;i<25;i++) {
                    BZ_ON();
                    LP_RIGHT_ON();
                    BR_LIGHT_ON();
                    Delay_ms(100);
                    showcard(Tx_Buffer,&rfid_set,rc522_SN);
                    Reset_RC522();
                    if(rfid_set == 1) {
                        UART2_SendString(Tx_Buffer, 17);
                        i=50;
                    }
                    BZ_OFF();
                    LP_RIGHT_OFF();
                    BR_LIGHT_OFF();
                    Delay_ms(100);
                }
                if(rfid_set == 1) {
                    UART2_SendStr("433m key learned!");
                    i=0;
                    while(i<15) {
                        LF_SendData(PATTERN1,PATTERN2,PATTREN_BIT,LF_SEND_CH1);
                        Delay_ms(250);
                        if (RFFull) {
                            RF_Remote();
                            UART2_SendStr("Get 433m key!");
                            break;
                        }
                        i++;
                    }

                    if (RF_set == 1) {
                        ret = Save_Combined_Key(rc522_SN, RF_UartSend);
                        if (ret > 0)
                            UART2_SendStr("Add 2 keys to eeprom failed!");
                        else
                            UART2_SendStr("Add 2 keys to eeprom!");
                    }
                    else {
                        UART2_SendStr("433m key not learned!");
                    }
                }
                 else {
                    UART2_SendStr("RFID key not learned!");
                }

                RF_set=0;
                rfid_set=0;
                TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
                UART2_SendStr("PKE_OPER_STA_LEARN out!");
                break;
            default:
                UART2_SendStr("Default state");
                TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
                break;
        }

    }
}
